{"id": "d94c969f-fa69-4db9-a737-46392b5b7696", "source": "ASMF guidelines.docx", "chunk_index": 0, "text": "ASMF by LocationSome Places we are getting more requests for that aren't in our service zone. Hudson Oaks - need to send them to GD Weatherford out of our service territory Aledo - $35 (already comes up Arlington) Midlothian - $35 (Arlington) Lavon- $35 (Dallas) Kaufman - $35 (Forney) Decatur- $250 "}
{"id": "cfb325da-07f7-4935-bf3f-494effcecda2", "source": "ASMF guidelines.docx", "chunk_index": 1, "text": "$35 (Dallas) Kaufman - $35 (Forney) Decatur- $250 OOSA (Out of Servia Area) fee Assessment Fee Guidelines (ASMF)$35 ASMF Applies to: Insulated Glass Units (IGUs) Single Pane Glass Pet Doors Shower Enclosures Patio Door Glass Standard Window Replacements Note: These fees can be waived and booked with"}
{"id": "dadcb41e-c9ab-4718-9714-3c877daf248e", "source": "ASMF guidelines.docx", "chunk_index": 2, "text": "nts Note: These fees can be waived and booked without collecting an ASMF, but please try to secure one either beforehand or onsite whenever possible. $75 ASMF Required for: Cabinet Glass Table Tops Mirrors Leaking Windows Windows that don’t open or close Shower Adjustments (Typically $225 minimum, n"}
{"id": "0a9ba2c2-deab-4e74-a1bc-4f1ef5a70ebb", "source": "ASMF guidelines.docx", "chunk_index": 3, "text": "lose Shower Adjustments (Typically $225 minimum, no warranty on material we do not provide) Anything considered outside the norm or that most glass companies wouldn’t typically handle We must collect the $75 ASMF or provide a phone quote for these types of jobs. $150 ASMF Full Home Inspections $250 "}
{"id": "923f5b78-f408-437e-9ab1-06aff83c93eb", "source": "ASMF guidelines.docx", "chunk_index": 4, "text": "pes of jobs. $150 ASMF Full Home Inspections $250 Water Test Leaking windows by require a water test if we cannot tell where that is going from. Specialists will quote that onsite. Auto Process:car: Auto Call Process – If Dak Is Unavailable If Dak is not available to take the auto call, please follo"}
{"id": "578eb395-2fa8-45eb-9753-3a553c555586", "source": "ASMF guidelines.docx", "chunk_index": 5, "text": " not available to take the auto call, please follow the steps below to ensure we properly handle the lead: Set Up the Customer in the System Collect as much info as possible to build the account. If the customer does not want to provide their address, use the following default address: 2001 Midway R"}
{"id": "b178cc81-94aa-43b9-a8d3-ac4351ff66f6", "source": "ASMF guidelines.docx", "chunk_index": 6, "text": ", use the following default address: 2001 Midway Rd, Suite 121, Carrollton, TX 75006 Verify the Cell Phone Number Double-check that you have the correct mobile number on file. Inform the Customer Let them know we will be sending them a text requesting: A photo of the vehicle/damage The full VIN numb"}
{"id": "5f7b91ca-99fa-4bcf-ba1c-1b1f8b919713", "source": "ASMF guidelines.docx", "chunk_index": 7, "text": "g: A photo of the vehicle/damage The full VIN number Explain that this information is essential for providing an accurate quote. Same-Day Service Requests If the customer asks for same-day service, notify the team in this order: Dak Trent Danny Hayden (last resort only) Text Message to Send the Cust"}
{"id": "b445e063-e3ec-4c27-bc14-4108f52b16c7", "source": "ASMF guidelines.docx", "chunk_index": 8, "text": "n (last resort only) Text Message to Send the Customer \"Hello! Please reply with the vehicle’s full VIN number and photos of the damage, at your convenience, to ensure the most accurate quote for your repair/replacement. Thank you! - Glass Doctor of North Texas\""}
{"id": "46ab5954-3ecd-4f06-80cb-17b159a6b800", "source": "ASMF guidelines.docx", "chunk_index": 9, "text": "North Texas\""}
